<?
    /* ============================================================================== */
    /* =   PAGE : 결제 정보 환경 설정 PAGE                                          = */
    /* = -------------------------------------------------------------------------- = */
    /* =   Copyright (c)  2021   KCP Inc.   All Rights Reserverd.                   = */
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   01. 지불 데이터 셋업 (업체에 맞게 수정)                                  = */
    /* = -------------------------------------------------------------------------- = */
    /* = ※ 주의 ※                                                                 = */
    /* = * g_conf_gw_url 설정                                                       = */
    /* =    테스트 시 : g_conf_gw_url = "testpaygw.kcp.co.kr" ;                     = */
    /* =    실결제 시 : g_conf_gw_url = "paygw.kcp.co.kr" ;                         = */
    /* =                                                                            = */
    /* = * g_conf_home_dir 설정                                                     = */
    /* =    샘플 소스를 보시면 bin 디렉토리 아래에 pp_cli 파일이 존재합니다.        = */
    /* =    /(root) 디렉토리에서 bin 디렉토리 전까지의 절대경로로 설정합니다.       = */
    /* = -------------------------------------------------------------------------- = */

    $g_conf_gw_url    = "paygw.kcp.co.kr";
    $g_conf_home_dir  = $_SERVER['DOCUMENT_ROOT']."/payment/linux/auto_pay/pc";
    
    /* ============================================================================== */
    /* = ※ 주의 ※                                                                 = */
    /* = * g_conf_log_path 변수 설정                                                = */
    /* =----------------------------------------------------------------------------= */
    /* =   log 경로 지정                                                            = */
    /* ============================================================================== */
    $g_conf_log_path = $_SERVER['DOCUMENT_ROOT']."/payment/linux/auto_pay/pc/bin/log";

    /* ============================================================================== */
    /* = ※ 주의 ※                                                                 = */
    /* = * g_conf_js_url 설정                                                       = */
    /* =----------------------------------------------------------------------------= */ 
    /* = ※ 표준 웹 결제창 전용 jsp 설정 ※                                           */
    /* = 테스트 시 : src="https://testpay.kcp.co.kr/plugin/payplus_web.jsp"         = */
    /* = 실결제 시 : src="https://pay.kcp.co.kr/plugin/payplus_web.jsp"             = */
    /* ============================================================================== */

    $g_conf_js_url    = "https://pay.kcp.co.kr/plugin/payplus_web.jsp";

    /* = -------------------------------------------------------------------------- = */
    /* =  이 부분은 수정하지 마십시오.                                              = */
    /* = -------------------------------------------------------------------------- = */

    $g_conf_log_level = "3";
    $g_conf_gw_port   = "8090";

    /* ============================================================================== */


    /* = -------------------------------------------------------------------------- = */
    /* =     02. 쇼핑몰 지불 필수 정보 설정(업체에 맞게 수정)                       = */
    /* = -------------------------------------------------------------------------- = */
    /* = ※ 주의 ※                                                                 = */
    /* =                                                                            = */
    /* =                                                                            = */
    /* = * g_conf_site_cd, g_conf_site_key 설정                                     = */
    /* =     실결제 시 :                                                            = */
    /* =         KCP에서 발급한 사이트코드(site_cd), 사이트키(site_key)를 반드시    = */
    /* =         변경해 주셔야 결제가 정상적으로 진행됩니다.                        = */
    /* =                                                                            = */
    /* =   테스트 시 :                                                              = */
    /* =         사이트코드(g_conf_site_cd) : BA001                                 = */
    /* =         사이트키(g_conf_site_key)  : 2T5.LgLrH--wbufUOvCqSNT__             = */
    /* =   실결제 시 :                                                              = */
    /* =         사이트코드(g_conf_site_cd) : KCP에서 발급한 사이트코드(site_cd)    = */
    /* =         사이트키(g_conf_site_key)  : KCP에서 발급한 사이트키(site_key)     = */
    /* =                                                                            = */
    /* = * g_conf_site_name 설정                                                    = */
    /* = 사이트명 설정(특수문자 불가) : 표준웹 결제창 오른쪽 상단에 표기되는 값입니다.             = */
    /* =                           반드시 영문자로 설정하여 주시기 바랍니다.              = */
    /* =                                                                            = */
    /* = -------------------------------------------------------------------------- = */

    $g_conf_site_cd   = "A7EPQ";
    $g_conf_site_key  = "2fGn7R3DOqE1oyTsI-8dQNf__";
    $g_conf_site_name = "ABLANC";

    /* ============================================================================== */
?>